[
    {
        "image":"",
        "title":"Running Away from God",
        "audio":"https://dts.podtrac.com/redirect.mp3/chrt.fm/track/D94462/traffic.libsyn.com/secure/renewingyourmind/rym20230913.mp3?dest-id=668712",
        "description":"When God calls us to lay our comfort aside, it's in our best interest to trust the One who chose us for the task. Today, R.C. Sproul describes the lengths Jonah went to flee from God and the Lord's tenacity in pursuing him."
    },
    {
        "image":"",
        "title":"Building amidst Opposition",
        "audio":"https://dts.podtrac.com/redirect.mp3/chrt.fm/track/D94462/traffic.libsyn.com/secure/renewingyourmind/rym20230912.mp3?dest-id=668712",
        "description":"Christians should not be surprised when opposition rises against the church--nor should we be discouraged. Today, R.C. Sproul gleans wisdom from the book of Nehemiah for Christians seeking the advance of God's kingdom today."
    },
    {
        "image":"",
        "title":"Be Strong and Courageous",
        "audio":"https://dts.podtrac.com/redirect.mp3/chrt.fm/track/D94462/traffic.libsyn.com/secure/renewingyourmind/rym20230911.mp3?dest-id=668712",
        "description":"When we face challenges that seem insurmountable, we have this unfailing assurance: the Lord is with us wherever we go. Today, R.C. Sproul draws encouragement from God's promise to Joshua after the death of Moses."
    },
    {
        "image":"",
        "title":"The Resurrection",
        "audio":"https://dts.podtrac.com/redirect.mp3/chrt.fm/track/D94462/traffic.libsyn.com/secure/renewingyourmind/rym20230910.mp3?dest-id=668712",
        "description":"Jesus was crucified, dead, and buried. But the grave could not contain the holy Son of God. Continuing his expositional series in the gospel of Luke, today R.C. Sproul preaches on the bedrock foundation of our hope: Christ's resurrection in victory over sin and death."
    },
    {
        "image":"",
        "title":"Worship in the Church",
        "audio":"https://dts.podtrac.com/redirect.mp3/chrt.fm/track/D94462/traffic.libsyn.com/secure/renewingyourmind/rym20230909.mp3?dest-id=668712",
        "description":"Why does the church gather together each week? It's more than fellowship and education. Ultimately, we gather for the worship of our holy God. Today, R.C. Sproul encourages us to offer worship to the Lord that is worthy of His name."
    }
]