[
    {
        "image":"",
        "title":"Marriage as Friendship",
        "audio":"https://chtbl.com/track/92298/mcdn.podbean.com/mf/web/82mdu3/230913_MarriageasFriendship.mp3",
        "description":"Marriage is a cosmic friendship, a spiritual friendship, a friendship with eternal dimensions. Marriage is not romance garnished with friendship. Rather, biblically, marriage is friendship garnished with romance.If you’re going to marry somebody, you should marry someone who is now or has the potential to be your very best friend. But friendship is not just a feeling of affection. Friendship is a particular form of love, and it has a structure.The structure of friendship is a deep oneness that comes from two people journeying together toward a common horizon. Let’s look now at 1) the common horizon, 2) how you get to that horizon, and 3) the implications of journeying together toward that horizon.This sermon was preached by Dr. Timothy Keller at Redeemer Presbyterian Church on September 15, 1991. Series:Marriage. Scripture: Ephesians 5:22-33."
    },
    {
        "image":"",
        "title":"Sexuality and Christian Hope",
        "audio":"https://chtbl.com/track/92298/mcdn.podbean.com/mf/web/3jqi6m/230901_SexualityandChristianHope.mp3",
        "description":"There are obvious ways Christian hope affects us, like in the way we face death and troubles. But I’d like to show you that Christian hope affects everything, every area of our lives.The biblical understanding of hope is a life-shaping, joyous certainty that your future is the eternal love and glory of God and a new heavens and new earth. And this Christian hope even determines and revolutionizes our whole attitude toward sex, romance, singleness, and marriage.This passage in 1 Corinthians 6 and 7 is outrageous in all sorts of ways. It shows us that 1) Christianity gave the world a revolutionary view of sex, 2) Christianity gave the world a revolutionary view of singleness and marriage, and 3) Christian hope radically reshapes our approach, our actions, and our attitudes in this area.This sermon was preached by Dr. Timothy Keller at Redeemer Presbyterian Church on April 18, 2004. Series: Living in Hope. Scripture: 1 Corinthians 6:13-20; 7:27-31."
    },
    {
        "image":"",
        "title":"Let Your Yes Be Yes",
        "audio":"https://chtbl.com/track/92298/mcdn.podbean.com/mf/web/psy75m/230825_LetYourYesBeYes.mp3",
        "description":"As we look at the hard sayings of Jesus, we see in this passage that Jesus gives us a radical principle of truthfulness.The whole Bible is built on covenants, public promises, observed words. So what does Jesus mean when he says to let your “yes” be “yes”? He can’t mean you can’t take oaths. What he does mean is actually something almost the opposite, that if you think you can separate and create levels of truthfulness, you’re wrong. Everything is observed. Every yes and every no is an oath.Jesus is teaching us 1) the importance of truthfulness, 2) the nature of truthfulness, and 3) how you become a person of integrity.This sermon was preached by Dr. Timothy Keller at Redeemer Presbyterian Church on February 14, 1993. Series: Hard Sayings of Jesus (1993). Scripture: Matthew 5:33-37."
    },
    {
        "image":"",
        "title":"Let the Dead Bury Their Dead",
        "audio":"https://chtbl.com/track/92298/mcdn.podbean.com/mf/web/ajxwah/230818_LetTheDeadBuryTheirDead.mp3",
        "description":"If Jesus was a pastor, I don’t think his church would’ve grown very fast. Any leader of a movement wants to make it easy for people to enter. But Jesus acts in a completely different way. People come and say, “I want to join up,” and Jesus says, “Get back. Think.”In Luke 9, Jesus does this because the three men clearly don’t understand what they are asking for. Therefore, if we take a look at how Jesus answers them, we’re going to learn a great deal about what it means to follow Jesus.What does it mean to be a follower of Jesus? This text shows us 1) that to follow Christ is to enter the kingdom, 2) that we need to understand the hardness of the kingdom, and 3) that we need to understand the greatness of the kingdom.This sermon was preached by Dr. Timothy Keller at Redeemer Presbyterian Church on January 24, 1993. Series: Hard Sayings of Jesus (1993). Scripture: Luke 9:57-60."
    },
    {
        "image":"",
        "title":"The Failure of Religion",
        "audio":"https://chtbl.com/track/92298/mcdn.podbean.com/mf/web/2fkng4/230705_TheFailureofReligion.mp3",
        "description":"We’re tracing the storyline of the entire Bible. We started in Genesis, where we learn what’s wrong with the human race, and we’ve come to Romans, where we learn what God has done about it through Jesus Christ.Here at the beginning of Romans 2, Paul does a turnaround. It’s so surprising and shocking I don’t have much to introduce. I’ll start to explain it, and it’ll draw us right in.This chapter tells us three things: 1) the failure of religion, because of 2) the terrible beauty of the law and, therefore, 3) the need for a regenerated, new heart.This sermon was preached by Dr. Timothy Keller at Redeemer Presbyterian Church on February 22, 2009. Series: Bible: The Whole Story - Creation and Fall. Scripture: Romans 2:1-6; 12-26."
    }
]