[
    {
        "image":"",
        "title":"How To Fight For Your Marriage",
        "audio":"https://chrt.fm/track/39AF68/afp-79919-injected.calisto.simplecastaudio.com/6d81e803-dd5a-4ef3-8439-2cf0c2444f41/episodes/7bb2dcf0-536f-4b41-97ab-fc5b60e8123a/audio/128/default.mp3?aid=rss_feed&awCollectionId=6d81e803-dd5a-4ef3-8439-2cf0c2444f41&awEpisodeId=7bb2dcf0-536f-4b41-97ab-fc5b60e8123a&feed=wZpv0WKy",
        "description":"If marriage feels difficult, it’s not because you and your spouse are incompatible. It’s because you’re married. On today’s episode, Jackie and Preston are joined by mentors and friends CD and Melody Fabien for a conversation about fighting for intimacy. They talk about recognizing dysfunctional rhythms, finding opportunities to connect, not building cases against your spouse, healthy confrontation, and utilizing the greatest tool God has given us to find oneness in marriage: communication."
    },
    {
        "image":"",
        "title":"Let’s Talk About Boldness",
        "audio":"https://chrt.fm/track/39AF68/afp-79919-injected.calisto.simplecastaudio.com/6d81e803-dd5a-4ef3-8439-2cf0c2444f41/episodes/b82da829-d977-4caa-b16a-30b463d4e571/audio/128/default.mp3?aid=rss_feed&awCollectionId=6d81e803-dd5a-4ef3-8439-2cf0c2444f41&awEpisodeId=b82da829-d977-4caa-b16a-30b463d4e571&feed=wZpv0WKy",
        "description":"Boldness isn’t making public stances on things all the time, and it’s not just saying everything that pops into your head. In this episode, Jackie and Preston talk about what it truly means to cultivate holistic boldness as a Christ follower today. It’s about obedience to God, death to self, and empowerment by the Holy Spirit. And you don’t have to feel bold to be bold. Let’s talk about it."
    },
    {
        "image":"",
        "title":"That Time We Broke Up...Twice",
        "audio":"https://chrt.fm/track/39AF68/afp-79919-injected.calisto.simplecastaudio.com/6d81e803-dd5a-4ef3-8439-2cf0c2444f41/episodes/a91a88d9-083a-4f55-9546-12d64c96a30c/audio/128/default.mp3?aid=rss_feed&awCollectionId=6d81e803-dd5a-4ef3-8439-2cf0c2444f41&awEpisodeId=a91a88d9-083a-4f55-9546-12d64c96a30c&feed=wZpv0WKy",
        "description":"From being long distance to living in the same city and then taking a pivotal trip together to the Caribbean, the Perrys’ dating relationship had a bit of a rocky start. Jackie ended things with Preston not once but twice, she says out of fear of Preston’s loving pursuit of her. It didn’t help that Preston didn’t know how to lead her well. There’s a lot they would have done differently, but in the end, their story is a reflection of Jesus’ Gospel pursuit of each of us."
    },
    {
        "image":"",
        "title":"A Word for Writers and Other Sufferers of Writer's Block",
        "audio":"https://chrt.fm/track/39AF68/afp-79919-injected.calisto.simplecastaudio.com/6d81e803-dd5a-4ef3-8439-2cf0c2444f41/episodes/fbc1aa07-9b15-4206-90f0-48cf36c2f098/audio/128/default.mp3?aid=rss_feed&awCollectionId=6d81e803-dd5a-4ef3-8439-2cf0c2444f41&awEpisodeId=fbc1aa07-9b15-4206-90f0-48cf36c2f098&feed=wZpv0WKy",
        "description":"A conversation with Preston about his book-writing experience turns into a much bigger dialogue about the creative process. Jackie asks Preston about the obstacles he’s run into moving from poet to author, and Preston explains why he really doesn’t believe in writer’s block. The Perrys talk about battling perfectionism, receiving critiques, and inviting other people into the writing journey."
    },
    {
        "image":"",
        "title":"A Random Conversation About Church",
        "audio":"https://chrt.fm/track/39AF68/afp-79919-injected.calisto.simplecastaudio.com/6d81e803-dd5a-4ef3-8439-2cf0c2444f41/episodes/4efe2908-ad9b-4700-a8cc-4abab210b0cc/audio/128/default.mp3?aid=rss_feed&awCollectionId=6d81e803-dd5a-4ef3-8439-2cf0c2444f41&awEpisodeId=4efe2908-ad9b-4700-a8cc-4abab210b0cc&feed=wZpv0WKy",
        "description":"Many of us got comfortable not going to church through the pandemic and we’re slowly finding our way back. The Bible tells us we need other Christians and we’re missing something if we don’t gather together to hear God’s Word. But our relationship to church can still be complicated. Jackie and Preston’s conversation today covers topics like worship style preferences, doctrinally sound preaching and discipleship, the pressure that local pastors face because of social media, and the topic of church hurt."
    }
]